# VertexBuffer Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexBuffer Class
Members See Also
---
A buffer that stores vertex data for rendering.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class VertexBuffer : IDisposable
```

Visual Basic
---
```text
Public Class VertexBuffer _
	Implements IDisposable
```

Visual C++
---
```text
public ref class VertexBuffer : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.DirectContext3D..::..VertexBuffer
# See Also
VertexBuffer Members
Autodesk.Revit.DB.DirectContext3D Namespace